# Cis 340 - Final Exam - Part 1  
- (10 pts) Dropping Columns   
- (5 pts) Renaming Columns]    
- (5 pts) Get Rid of Non-Numeric Junk    
- (5 pts) Change Data Types]     
- (10 pts) Subset/Filter Dataframe    
- (5 pts) Sort   
- (10 pts) Do Calculations    

**Important Reminder:**  *You must show the results of each of the above steps! If you do the step, but then don't show that the results were successful, you will receive a zero for it.*

In [17]:
import pandas as pd

**Important Note:**  *Do not change the data hardcoded into df_customers below!  You must use it exactly as is.*

In [18]:
# Data to work on
df_customers = pd.DataFrame(
    [
    [1702,1,'Robinett, David','david22@adventure-works.com', '(827) 525-0100', '06-05-2010', '$80,950', 'dsfkjdfl','dsfkjdfl'], 
    [1703,2,'Roberson, Rebecca','rebecca5 @adventure-works.com', '(829) 525-0101', '05-01-2015', '$70,950','dsfkjdfl','dsfkjdfl'],
    [1704,2,'Zillo, Dan','dan3@adventure-works.com', '(828) 555-0102', '03-01-2017', '$50,000','dsfkjdfl','dsfkjdfl'],
    [1700,1,'Craft, Reba','rebea@adventure-works.com', '(829) 525-0101', '05-01-2015', '$70,950','dsfkjdfl','dsfkjdfl'],
    [1698,2,'Craft, Maria','maria5@adventure-works.com', '(829) 525-0101', '05-01-2015', '$70,950','dsfkjdfl','dsfkjdfl'],
    [1699,2,'Adams, Jorge','adams9@adventure-works.com', '(827) 525-0100', '06-05-2010', '$80,950', 'dsfkjdfl','dsfkjdfl'],   
    [1696,2,'Forney, Dorothy','dorothy3@adventure-works.com', '(828) 555-0102', '03-01-2017', '$50,00','dsfkjdfl','dsfkjdfl'],
    [1701,3,'Forbes, Donna','donna@adventure-works.com', '(828) 555-0102', '03-01-2017', '$50,00','dsfkjdfl','dsfkjdfl']
    ], 
    columns=['CustomerID', 'SalesRegion', 'CustomerName','EmailAddress', 'PhoneNumber', 'FirstPurchaseDate', 'TotalSales', 'OtherInfo1', 'OtherInfo2'])
  
df_customers

,CustomerID,SalesRegion,CustomerName,EmailAddress,PhoneNumber,FirstPurchaseDate,TotalSales,OtherInfo1,OtherInfo2
0,1702,1,"Robinett, David",david22@adventure-works.com,(827) 525-0100,06-05-2010,"$80,950",dsfkjdfl,dsfkjdfl
1,1703,2,"Roberson, Rebecca",rebecca5 @adventure-works.com,(829) 525-0101,05-01-2015,"$70,950",dsfkjdfl,dsfkjdfl
2,1704,2,"Zillo, Dan",dan3@adventure-works.com,(828) 555-0102,03-01-2017,"$50,000",dsfkjdfl,dsfkjdfl
3,1700,1,"Craft, Reba",rebea@adventure-works.com,(829) 525-0101,05-01-2015,"$70,950",dsfkjdfl,dsfkjdfl
4,1698,2,"Craft, Maria",maria5@adventure-works.com,(829) 525-0101,05-01-2015,"$70,950",dsfkjdfl,dsfkjdfl
5,1699,2,"Adams, Jorge",adams9@adventure-works.com,(827) 525-0100,06-05-2010,"$80,950",dsfkjdfl,dsfkjdfl
6,1696,2,"Forney, Dorothy",dorothy3@adventure-works.com,(828) 555-0102,03-01-2017,"$50,00",dsfkjdfl,dsfkjdfl
7,1701,3,"Forbes, Donna",donna@adventure-works.com,(828) 555-0102,03-01-2017,"$50,00",dsfkjdfl,dsfkjdfl

# (10 pts) Dropping Columns  
Drop the following columns: **PhoneNumber**, **OtherInfo1** and **OtherInfo2**

In [19]:
df_customers.drop(['PhoneNumber', 'OtherInfo1', 'OtherInfo2'], axis='columns', inplace=True)

df_customers.head()

,CustomerID,SalesRegion,CustomerName,EmailAddress,FirstPurchaseDate,TotalSales
0,1702,1,"Robinett, David",david22@adventure-works.com,06-05-2010,"$80,950"
1,1703,2,"Roberson, Rebecca",rebecca5 @adventure-works.com,05-01-2015,"$70,950"
2,1704,2,"Zillo, Dan",dan3@adventure-works.com,03-01-2017,"$50,000"
3,1700,1,"Craft, Reba",rebea@adventure-works.com,05-01-2015,"$70,950"
4,1698,2,"Craft, Maria",maria5@adventure-works.com,05-01-2015,"$70,950"

# (5 pts) Renaming Columns  
Rename the following columns:  
1. **CustomerID** to **customer_id**
2. **CustomerName** to **customer_name**   
3. **EmailAddress** to **email_address**

In [21]:
new_columns = {'CustomerID':'customer_id', 'CustomerName':'customer_name', 'EmailAddress':'email_address'}

df_customers.rename(columns= new_columns, inplace=True)
df_customers.head()

,customer_id,SalesRegion,customer_name,email_address,FirstPurchaseDate,TotalSales
0,1702,1,"Robinett, David",david22@adventure-works.com,06-05-2010,"$80,950"
1,1703,2,"Roberson, Rebecca",rebecca5 @adventure-works.com,05-01-2015,"$70,950"
2,1704,2,"Zillo, Dan",dan3@adventure-works.com,03-01-2017,"$50,000"
3,1700,1,"Craft, Reba",rebea@adventure-works.com,05-01-2015,"$70,950"
4,1698,2,"Craft, Maria",maria5@adventure-works.com,05-01-2015,"$70,950"

# (5 pts) Get Rid of Non-Numeric Junk  
- Get rid of the non-numeric junk in any column that contains dollar/currency values

In [22]:
# Get rid of non-numeric junk in the Price field
df_customers['TotalSales'] = df_customers['TotalSales'].str.replace('$', '')
df_customers['TotalSales'] = df_customers['TotalSales'].str.replace(',', '')

df_customers['TotalSales'].head()

0    80950
1    70950
2    50000
3    70950
4    70950
Name: TotalSales, dtype: object

# (5 pts) Change Data Types  
1. Change the data type of any column that contains dollar/currency values to a float  
2. Change the data type of any column that contains Date values to a DateTime

In [23]:
df_customers.dtypes

customer_id           int64
SalesRegion           int64
customer_name        object
email_address        object
FirstPurchaseDate    object
TotalSales           object
dtype: object

In [27]:
df_customers['FirstPurchaseDate'] = pd.to_datetime(df_customers['FirstPurchaseDate'])
df_customers['TotalSales'] = pd.to_numeric(df_customers['TotalSales']).astype(float)

df_customers.dtypes

customer_id                   int64
SalesRegion                   int64
customer_name                object
email_address                object
FirstPurchaseDate    datetime64[ns]
TotalSales                  float64
dtype: object

# (10 pts) Subset/Filter Dataframe  
Based on the current dataframe, create a new dataframe that only has customers from Sales Region:  **2**

In [34]:
filter = df_customers['SalesRegion'] == 2

df_region = df_customers[filter]

df_region.head()

,customer_id,SalesRegion,customer_name,email_address,FirstPurchaseDate,TotalSales
1,1703,2,"Roberson, Rebecca",rebecca5 @adventure-works.com,2015-05-01,70950.0
2,1704,2,"Zillo, Dan",dan3@adventure-works.com,2017-03-01,50000.0
4,1698,2,"Craft, Maria",maria5@adventure-works.com,2015-05-01,70950.0
5,1699,2,"Adams, Jorge",adams9@adventure-works.com,2010-06-05,80950.0
6,1696,2,"Forney, Dorothy",dorothy3@adventure-works.com,2017-03-01,5000.0

# (5 pts) Sort  
Sort the subsetted/filtered dataframe by customer name, from a-z

In [37]:
df_region.sort_values(['customer_name'], inplace=False, ascending=True)

,customer_id,SalesRegion,customer_name,email_address,FirstPurchaseDate,TotalSales
5,1699,2,"Adams, Jorge",adams9@adventure-works.com,2010-06-05,80950.0
4,1698,2,"Craft, Maria",maria5@adventure-works.com,2015-05-01,70950.0
6,1696,2,"Forney, Dorothy",dorothy3@adventure-works.com,2017-03-01,5000.0
1,1703,2,"Roberson, Rebecca",rebecca5 @adventure-works.com,2015-05-01,70950.0
2,1704,2,"Zillo, Dan",dan3@adventure-works.com,2017-03-01,50000.0

# (10 pts) Do Calculations
- Note:  You do NOT have to format your calculated numbers!

### Calculate and display the Sum of the TotalSales column for the *df_customers* dataframe

In [43]:
sum_total = df_customers['TotalSales'].sum()
print("The sum of total sales is",sum_total)

The sum of total sales is 434750.0

### Calculate and display the Sum of the TotalSales column of the subsetted/filtered dataframe

In [44]:
sum_region = df_region['TotalSales'].sum()
print("The sum of total sales in region 2 is",sum_region)

The sum of total sales in region 2 is 277850.0